### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [580]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [581]:
#Calculate the total number of unique players

player_count=purchase_data["SN"].unique()
#player_count
total=len(player_count)
total

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [582]:
#Calculate the number of unique items
unique_items=purchase_data["Item ID"].unique()
number_of_unique_items=len(unique_items)
number_of_unique_items

183

In [583]:
#Use Groupby functions and 
average_price=purchase_data.groupby(["Item Name"])
average_price_df=average_price["Age","Price"].mean()

#Format the numbers
average_price_df["Age"]=average_price_df["Age"]. map("{:.0f}".format)
average_price_df["Price"]=average_price_df["Price"]. map("${:.2f}".format)

#Rename the columns since now the data are all "averaged"
average_priceage_df=average_price_df.rename(columns={"Age":"Average Age","Price":"Average Price"})
average_priceage_df.head()

                               Average Age Average Price
Item Name
Abyssal Shard                           22         $2.67
Aetherius, Boon of the Blessed          25         $3.39
Agatha                                  21         $3.08
Alpha                                   22         $2.07
Alpha, Oath of Zeal                     23         $4.05

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [584]:
#Use grouby function to get all the unique counts in the gender column
grouped_player=purchase_data.groupby(["Gender"])
grouped_player["SN"].value_counts()
Total_number_of_player=grouped_player['SN'].nunique()
Total_number_of_player

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [585]:
#Calculate Male percentage 
Male_percentage=Total_number_of_player["Male"]/(Total_number_of_player["Male"]+Total_number_of_player["Female"]+Total_number_of_player["Other / Non-Disclosed"])
Male_percentage.round(2)

0.84

In [586]:
#Calculate Female percentage 
Female_percentage=Total_number_of_player["Female"]/(Total_number_of_player["Male"]+Total_number_of_player["Female"]+Total_number_of_player["Other / Non-Disclosed"])
Female_percentage.round(2)

0.14

In [587]:
#Calculate "Other" or "Non-specified" gender percentage 
Other_percentage=Total_number_of_player["Other / Non-Disclosed"]/(Total_number_of_player["Male"]+Total_number_of_player["Female"]+Total_number_of_player["Other / Non-Disclosed"])
Other_percentage.round(2)

0.02


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [588]:
#Get the first series about purchase count by gender
Purchase_count=grouped_player["Item ID"].count()
Purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Item ID, dtype: int64

In [589]:
#Get the second series about average price by gender
Average_price=grouped_player["Price"].mean().round(2)
Average_price

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [590]:
#Merge the two series above in to a dataframe and then rename the columns
merge_table=pd.merge(Purchase_count,Average_price,on="Gender")
merged_table=merge_table.rename(columns={"Price":"Average Price","Item ID":"Purchase Count"})
merged_table

                       Purchase Count  Average Price
Gender
Female                            113           3.20
Male                              652           3.02
Other / Non-Disclosed              15           3.35

In [591]:
#Calcualte the total purchase per person by gender
avg_purchase_female=merged_table.iloc[0,0]/Total_number_of_player["Female"]
avg_purchase_female

1.3950617283950617

In [592]:
avg_purchase_male=merged_table.iloc[1,0]/Total_number_of_player["Male"]
avg_purchase_male

1.3471074380165289

In [593]:
avg_purchase_other=merged_table.iloc[2,0]/Total_number_of_player["Other / Non-Disclosed"]
avg_purchase_other

1.3636363636363635

In [594]:
#Adding another column in the end for average purchase number by gender
merged_table["Average Purchase Per Persion"]=[avg_purchase_female.round(2),avg_purchase_male.round(2),avg_purchase_other.round(2)]
merged_table

,Purchase Count,Average Price,Average Purchase Per Persion
Gender,,,
Female,113,3.20,1.40
Male,652,3.02,1.35
Other / Non-Disclosed,15,3.35,1.36

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [595]:
#Creating bins, starting from zero, 50 the upper boundry
bins=[0,10,20,30,40,50]
group_names=["less than 10","11 to 20","21 to 30","31 to 40","41 to 50"]

#We are adding a new column "Age Range" as a resulting of binning
purchase_data["Age Range"]=pd.cut(purchase_data["Age"],bins,labels=group_names)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,11 to 20
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,31 to 40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,21 to 30
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,21 to 30
4,4,Iskosia90,23,Male,131,Fury,1.44,21 to 30

In [596]:
grouped_data=purchase_data.groupby(["Age Range"])
series=grouped_data["SN"].count()
series

#Conver this series into a dataframe
df=pd.DataFrame(series)
df

               SN
Age Range
less than 10   32
11 to 20      254
21 to 30      402
31 to 40       85
41 to 50        7

In [597]:
#Calcualte the purchase percentage for all the age range. 
less_than_10=series["less than 10"]/(series["less than 10"]+series["11 to 20"]+series["21 to 30"]+series["31 to 40"]+series["41 to 50"])
less_than_10.round(2)

0.04

In [598]:
Eleven_to_twentiy=series["11 to 20"]/(series["less than 10"]+series["11 to 20"]+series["21 to 30"]+series["31 to 40"]+series["41 to 50"])
Eleven_to_twentiy.round(2)

0.33

In [599]:
Twentyone_to_thirty=series["21 to 30"]/(series["less than 10"]+series["11 to 20"]+series["21 to 30"]+series["31 to 40"]+series["41 to 50"])
Twentyone_to_thirty.round(2)

0.52

In [600]:
Thirtyone_to_forty=series["31 to 40"]/(series["less than 10"]+series["11 to 20"]+series["21 to 30"]+series["31 to 40"]+series["41 to 50"])
Thirtyone_to_forty.round(2)

0.11

In [601]:
Fortyone_to_fifty=series["41 to 50"]/(series["less than 10"]+series["11 to 20"]+series["21 to 30"]+series["31 to 40"]+series["41 to 50"])
Fortyone_to_fifty.round(2)

0.01

In [602]:
#Adding the percentage column at the end of the dataframe that we converted from series.

df["Percentage"]=[less_than_10.round(2),Eleven_to_twentiy.round(2),Twentyone_to_thirty.round(2),Thirtyone_to_forty.round(2),Fortyone_to_fifty.round(2)]
df=df.rename(columns={"SN":"Purchase Counts"})
df

              Purchase Counts  Percentage
Age Range
less than 10               32        0.04
11 to 20                  254        0.33
21 to 30                  402        0.52
31 to 40                   85        0.11
41 to 50                    7        0.01

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [603]:
#Reshowing the original data after binning and adding the column Age Range
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,11 to 20
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,31 to 40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,21 to 30
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,21 to 30
4,4,Iskosia90,23,Male,131,Fury,1.44,21 to 30

In [604]:
#Grouping by the column Age Range
groupby_age=purchase_data.groupby(["Age Range"])
purchase_count_age=groupby_age["Item ID"].count()
purchase_count_age

Age Range
less than 10     32
11 to 20        254
21 to 30        402
31 to 40         85
41 to 50          7
Name: Item ID, dtype: int64

In [605]:
purchase_price_age=groupby_age["Price"].mean()
purchase_price_age.round(2)

Age Range
less than 10    3.40
11 to 20        3.06
21 to 30        2.99
31 to 40        3.15
41 to 50        3.08
Name: Price, dtype: float64

In [606]:
Player_number_by_age=groupby_age["SN"].nunique()
Player_number_by_age

Age Range
less than 10     24
11 to 20        191
21 to 30        291
31 to 40         63
41 to 50          7
Name: SN, dtype: int64

In [607]:
Average_purchase_by_age=purchase_count_age/Player_number_by_age
Average_purchase_by_age.round(2)

Age Range
less than 10    1.33
11 to 20        1.33
21 to 30        1.38
31 to 40        1.35
41 to 50        1.00
dtype: float64

In [608]:
Merged_by_name=pd.merge(purchase_price_age.round(2),Player_number_by_age,on="Age Range")
Merged_by_name
Merged_by_name["Average Purchase by Age"]=Average_purchase_by_age.round(2)
Merged_by_name=Merged_by_name.rename(columns={"SN":"Number of unique players","Price":"Average Price"})
Merged_by_name["Average Price"]=Merged_by_name["Average Price"].map("${:.2f}".format)
Merged_by_name

             Average Price  Number of unique players  Average Purchase by Age
Age Range
less than 10         $3.40                        24                     1.33
11 to 20             $3.06                       191                     1.33
21 to 30             $2.99                       291                     1.38
31 to 40             $3.15                        63                     1.35
41 to 50             $3.08                         7                     1.00

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [609]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,11 to 20
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,31 to 40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,21 to 30
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,21 to 30
4,4,Iskosia90,23,Male,131,Fury,1.44,21 to 30

In [610]:
#These two steps are for goruping by player ID and print out the counts 
Groupbyplayer=purchase_data.groupby(["SN"])
Topspender=Groupbyplayer["Price"].sum()

#Convert the series into a dataframe
Topspender_df=Topspender.to_frame()
#Topspender_df
Topspender_df=Topspender_df.reset_index()

#Sorting out the counts number and now I only want the column Item ID 
Topspender_df=Topspender_df.sort_values(["Price"],ascending=False)
#Reset the index after sorting and drop the old index
Topspender_df=Topspender_df.reset_index(drop=True)
Topspender_df.head()

            SN  Price
0    Lisosia93  18.96
1  Idastidru52  15.45
2   Chamjask73  13.83
3       Iral74  13.62
4  Iskadarya95  13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [611]:
#Reshowing the original dataframe after binning here 
purchase_data.head()
#purchase_data[["Item ID","Item Name","Price"]].head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,11 to 20
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,31 to 40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,21 to 30
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,21 to 30
4,4,Iskosia90,23,Male,131,Fury,1.44,21 to 30

In [618]:
#Group by column Item Name
grouped_df=purchase_data.groupby(["Item Name"])
Popular_item=grouped_df["Item ID",].count()
#Popular_item

#Sorting the dataframe and save the sorted dataframe into a new variable Renamed_Popular_item
Renamed_Popular_item=Popular_item.sort_values("Item ID", ascending=False)

#Rename the sorted dataframe
Renamed_Popular_item=Renamed_Popular_item.rename(columns={"Item ID":"Item counts"})
Renamed_Popular_item.head()

                                              Item counts
Item Name
Final Critic                                           13
Oathbreaker, Last Hope of the Breaking Storm           12
Persuasion                                              9
Nirvana                                                 9
Extraction, Quickblade Of Trembling Hands               9

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [613]:
Profit_df=purchase_data.groupby(["Item ID"])
Profit_df=Profit_df["Price"].sum()
Profit_df=Profit_df.to_frame()
Profit_df.sort_values("Price", ascending=False).head()

         Price
Item ID
178      50.76
82       44.10
145      41.22
92       39.04
103      34.80